'''
第二周作业：
    尝试完成一个多分类任务的训练:一个随机向量，哪一维数字最大就属于第几类。

    实现目的：
    一组向量[0.1, 0.4, 0.3]
    则该向量属于第 1 类
'''

import torch.nn as nn
import torch

#生成所需要的数据
def generate_data(batch_size = 64):
    x = torch.rand(batch_size, 5) #生成64个样本，每个样本5维
    y = torch.argmax(x, dim = 1) #在每一行找最大值并返回索引
    return x, y

model = nn.Linear(5, 5) #定义一个线性层

criterion = nn.CrossEntropyLoss() #loss

lr = 0.1 #学习率
for epoch in range(200): #训练200轮
    x, y = generate_data() #获取数据

    output = model(x) #前向传播
    loss = criterion(output, y)#计算损失

    loss.backward()#反向传播

    with torch.no_grad(): #更新参数
        for param in model.parameters():
            param -= lr * param.grad # w = w - lr * grad
            param.grad.zero_() #清空梯度

    if epoch % 20 == 0:
        print(f"epoch:{epoch}, loss = {loss.item():4f}")

#测试
test1, test2 = generate_data()
pred = model(test1).argmax(dim = 1)

print("\n测试结果：\n")
for i in range(10):
    print(f"输入：{test1[i].tolist()}")
    print(f"预测：{pred[i].item()} 真实：{test2[i].item()}")



结果输出：
epoch:0, loss = 1.647573
epoch:20, loss = 1.590632
epoch:40, loss = 1.495643
epoch:60, loss = 1.436893
epoch:80, loss = 1.402437
epoch:100, loss = 1.392285
epoch:120, loss = 1.368733
epoch:140, loss = 1.309544
epoch:160, loss = 1.317865
epoch:180, loss = 1.228833

测试结果：
输入：[0.8353472352027893, 0.8493130803108215, 0.20545518398284912, 0.777653157711029, 0.4889194965362549]
预测：3 真实：1
输入：[0.3143101930618286, 0.4823734164237976, 0.7377853989601135, 0.9668349623680115, 0.6456239819526672]
预测：3 真实：3
输入：[0.29855865240097046, 0.026655614376068115, 0.5015873908996582, 0.13986337184906006, 0.3102853298187256]
预测：2 真实：2
输入：[0.9675594568252563, 0.23821860551834106, 0.37760305404663086, 0.7295988202095032, 0.7055294513702393]
预测：0 真实：0
输入：[0.8524296879768372, 0.7912121415138245, 0.07948410511016846, 0.9110227227210999, 0.9843978881835938]
预测：4 真实：4
输入：[0.6248221397399902, 0.7714762091636658, 0.1363014578819275, 0.3883146643638611, 0.5131672620773315]
预测：1 真实：1
输入：[0.7711449265480042, 0.8098922967910767, 0.006875932216644287, 0.44154858589172363, 0.232674241065979]
预测：0 真实：1
输入：[0.8987410664558411, 0.5529837012290955, 0.6604975461959839, 0.8809962272644043, 0.5358495712280273]
预测：3 真实：0
输入：[0.3314098119735718, 0.9786312580108643, 0.5184614658355713, 0.11498820781707764, 0.5471993088722229]
预测：1 真实：1
输入：[0.8415018916130066, 0.6316001415252686, 0.7378507852554321, 0.5754455327987671, 0.9053568243980408]
预测：4 真实：4



